frame/anaphoraResolution.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://resolution.anaphora.uaic/">
	<soapenv:Body>
		<res:solveLinks>
			<text></text>
			<language></language>
		</res:solveLinks>
	</soapenv:Body>
</soapenv:Envelope>
